app/controllers/exams_controller.rb

SELECT "exams".* FROM "exams" WHERE "exams"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "sections".* FROM "sections" WHERE "sections"."exam_id" = 1 LIMIT 1
---
  def show
    @exam = Exam.find(params[ :id])
    @section = @exam.sections.first