app/controllers/sections_controller.rb

  def show
    @section = Section.find(params[ :id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1"]]