app/controllers/users_controller.rb

INSERT INTO "users" ("aboutme", "created_at", "dateofbirth", "email", "password_digest", "remember_token", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    if session[:auth] == true
      @user = User.new(params[ :user])
      if @user.save