app/views/exams/show.html.erb

SELECT "sections".* FROM "sections" WHERE "sections"."exam_id" = 1 LIMIT 1
---
        <p>Question {{question.order}}</p>
      </div>
    </div>
  </div>
  <div class="results_right">
    <div ng-hide="sectionOutcome(0)">
      <div class="outcomeFail">
      </div>
      <p>Unfortunately not all your answers were correct, click the button below to restart the section and to watch the video again!</p>
      <a href="#" class="test_button" ng-click="repeatSection($event)">Repeat Section</a>
    </div>
    <div ng-show="sectionOutcome(0)">
      <div class="outcomePass">
      </div>
      <p>Congratulations, you have completed the section! Please move onto the next section.</p>
      <a href="#" class="test_button" ng-click="nextSection($event)">Next Section</a>
    </div>
  </div>
  <div class="clear"></div>
  <div ng-repeat="section in sections">
    <div ng-repeat="question in section.questions" ng-hide="answerCorrectBool(question.order, question.correct)">
      <p class="questionText">{{question.order}}) {{question.question_text}}</p>